# On Time and Delayed Flights from Alaska and AM West Airlines

In [1]:
import pandas as pd

# Reading data into Pandas to analyze

In [11]:
df = pd.read_csv("flight_info.csv")

In [12]:
df

,Unnamed: 0,Unnamed: 1,Los Angeles,Phoenix,San Diego,San Francisco,Seattle
0,Alaska,on time,497,221,212,503,1841
1,Alaska,delayed,62,12,20,102,305
2,AM West,on time,694,4840,383,320,201
3,AM West,delayed,117,415,65,129,61

# Adding total on time and delayed flights columns

In [121]:
df['Total Delayed']=df.sum(axis='columns')
df['Total Flights On Time']=df.sum(axis='columns')

# Clearing false values

In [122]:
df

,,,Los Angeles,Phoenix,San Diego,San Francisco,Seattle,Total Flights On Time,Total Delayed
0,Alaska,on time,497.0,221.0,212.0,503.0,1841.0,3274.0,6548.0
1,Alaska,delayed,62.0,12.0,20.0,102.0,305.0,0.0,1002.0
2,AM West,on time,694.0,4840.0,383.0,320.0,201.0,6438.0,25752.0
3,AM West,delayed,117.0,415.0,65.0,129.0,61.0,0.0,787.0

In [124]:
df = df.replace(to_replace=[6548,25752], value=0)

In [100]:
df = df.replace(to_replace=[501,787], value=0)

In [125]:
df

,,,Los Angeles,Phoenix,San Diego,San Francisco,Seattle,Total Flights On Time,Total Delayed
0,Alaska,on time,497.0,221.0,212.0,503.0,1841.0,3274.0,0.0
1,Alaska,delayed,62.0,12.0,20.0,102.0,305.0,0.0,1002.0
2,AM West,on time,694.0,4840.0,383.0,320.0,201.0,6438.0,0.0
3,AM West,delayed,117.0,415.0,65.0,129.0,61.0,0.0,787.0

# Here we can see that AM West had the most 'on time' flights, and Alaska had the most 'delayed' flights

In [127]:
df['Total Flights On Time'].max()

6438.0

In [128]:
df['Total Delayed'].max()

1002.0